Feature: 二维码扫描结果

  Scenario: 根据条码结果输出小票
    Given 条码扫描数据有
      """
      [
        "    _  _     _  _  _  _ ",
        "|   _| _||_||_ |_   ||_|",
        "|  |_  _|  | _||_|  ||_|",
        "",
        " _  _  _     _  _  _  _ ",
        " _| _| _||_||_ |_   ||_|",
        "|_ |_  _|  | _||_|  ||_|",
        "3"
        ]
      """
    And 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    | 0  |
      | 22345678 | milk  | 12.30 | L  | 0  |
    Then 扫描条码结果为
    """
     {
      "data": [
        "****** SuperMarket receipt ******",
        "pizza: 1 x 15.00 --- 15.00",
        "milk: 3(L) x 12.30 --- 36.90",
        "---------------------------------",
        "total: 51.90(CNY)",
        "*********************************"
      ]
    }
    """


  Scenario: 根据条码结果输出小票
    Given 条码扫描数据有
      """
      [
        " _ ",
        "|_|",
        "|_|",
        "1"
      ]
      """
    And 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    | 0  |
      | 22345678 | milk  | 12.30 | L  | 0  |
    Then 扫描条码结果为
    """
     {
      "data": null,
      "error": "item doesn't exist: 8"
    }
    """

  Scenario: 类型1没有数量抛出异常
    Given 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    | 1  |
      | 22345678 | milk  | 12.30 | L  | 1  |
    When 条码扫描数据有
      """
      [
        " _  _  _     _  _  _  _ ",
        " _| _| _||_||_ |_   ||_|",
        "|_ |_  _|  | _||_|  ||_|",
        ""
        ]
      """
    Then 扫描条码结果为
    """
     {
      "data": null,
      "error": "wrong quantity of 22345678"
    }
    """
