Feature: 二维码扫描结果

  Scenario: 根据条码结果输出小票
    Given 条码扫描数据有
      | 条目         |
      | 12345678   |
      | 22345678-3 |
    And 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    |    |
      | 22345678 | milk  | 12.30 | L  |    |
    Then 扫描条码结果为
    """
     {
      "data": [
        "****** SuperMarket receipt ******",
        "pizza: 1 x 15.00 --- 15.00",
        "milk: 3(L) x 12.30 --- 36.90",
        "---------------------------------",
        "total: 51.90(CNY)",
        "*********************************"
      ]
    }
    """


  Scenario: 根据条码结果输出小票
    Given 条码扫描数据有
      | 条目         |
      | 88888888   |
    And 有商品
      | 条码       | 名称    | 价格    | 单位 | 类型 |
      | 12345678 | pizza | 15.00 |    |    |
      | 22345678 | milk  | 12.30 | L  |    |
    Then 扫描条码结果为
    """
     {
      "data": null,
      "error": "item doesn't exist: 88888888"
    }
    """
